<!-- dflook/terraform-github-actions {"workspace":"staging","backend_type":"s3","label":"staging","backend":"9a06bc18499a5e7b450cd3210cc0f671951acabebb47dd200fc6aac916836e40","plan_job_ref":"Job plan #21 at https://github.com/GSA/usnotify-ssb/actions/runs/8927900115","plan_hash":"fcc7af3e3762f0c6cb315a0e5c042f9d410057f9d03894ba1c2a54b6fa15f949","plan_text_format":"diff","version":"1.42.0","plan_out_hash":"0e2c6785cd3b25ef6a6936e3b4e1343fe4772decd4db7d851a8b58e64e8c2ab7","closed":true} -->
Terraform plan for __staging__
<details>
<summary>Plan: 8 to add, 0 to change, 6 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-demo"] will be destroyed
  # (because key ["gsa-tts-benefits-studio-prototyping/notify-demo"] is not in for_each map)
-   resource "cloudfoundry_service_broker" "space_scoped_broker" {
-       catalog_change                   = false -> null
-       catalog_hash                     = "AtlUxapKsXPtLbJRtxZTa2Ts44c=" -> null
-       fail_when_catalog_not_accessible = false -> null
-       id                               = "5ee0d213-483d-416d-9eb1-76f0c8348193" -> null
-       name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-demo" -> null
-       password                         = (sensitive value) -> null
-       service_plans                    = {
-           "ttsnotify-sms/base" = "9c8d67f5-ab9d-44c7-9f65-a35b55a2a401"
        } -> null
-       services                         = {
-           "ttsnotify-sms" = "ed5b0e74-dacc-4511-8514-410bef51b554"
        } -> null
-       space                            = "0b28b133-9f7b-49f1-9f34-a179cbb2549f" -> null
-       url                              = "https://ssb-sms-notify-management-staging.app.cloud.gov" -> null
-       username                         = "71880e4f-e3e6-3a99-b492-226f2306bce1" -> null
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-management-staging"] will be destroyed
  # (because key ["gsa-tts-benefits-studio-prototyping/notify-management-staging"] is not in for_each map)
-   resource "cloudfoundry_service_broker" "space_scoped_broker" {
-       catalog_change                   = false -> null
-       catalog_hash                     = "AtlUxapKsXPtLbJRtxZTa2Ts44c=" -> null
-       fail_when_catalog_not_accessible = false -> null
-       id                               = "41c1036b-ee10-4aac-b208-5f23f6518125" -> null
-       name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-management-staging" -> null
-       password                         = (sensitive value) -> null
-       service_plans                    = {
-           "ttsnotify-sms/base" = "eb5d4ef3-e734-4021-bd84-a2d882225ef0"
        } -> null
-       services                         = {
-           "ttsnotify-sms" = "a6369905-f0a1-4e83-b57f-fd53c0ebf482"
        } -> null
-       space                            = "d835086a-1ce4-4b9e-bb0f-6b01a560b24a" -> null
-       url                              = "https://ssb-sms-notify-management-staging.app.cloud.gov" -> null
-       username                         = "71880e4f-e3e6-3a99-b492-226f2306bce1" -> null
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-staging"] will be destroyed
  # (because key ["gsa-tts-benefits-studio-prototyping/notify-staging"] is not in for_each map)
-   resource "cloudfoundry_service_broker" "space_scoped_broker" {
-       catalog_change                   = false -> null
-       catalog_hash                     = "AtlUxapKsXPtLbJRtxZTa2Ts44c=" -> null
-       fail_when_catalog_not_accessible = false -> null
-       id                               = "203e6fa1-f100-4a22-93bb-ae6492d93e36" -> null
-       name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-staging" -> null
-       password                         = (sensitive value) -> null
-       service_plans                    = {
-           "ttsnotify-sms/base" = "9cfe0fad-3a46-42e9-a2ee-3f9bf1340816"
        } -> null
-       services                         = {
-           "ttsnotify-sms" = "9c59e780-af5a-4a89-ac31-591a3ae1347e"
        } -> null
-       space                            = "9745decb-4988-4bab-88a4-e3f07b36241c" -> null
-       url                              = "https://ssb-sms-notify-management-staging.app.cloud.gov" -> null
-       username                         = "71880e4f-e3e6-3a99-b492-226f2306bce1" -> null
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio/notify-demo"] will be created
+   resource "cloudfoundry_service_broker" "space_scoped_broker" {
+       catalog_change                   = false
+       catalog_hash                     = (known after apply)
+       fail_when_catalog_not_accessible = false
+       id                               = (known after apply)
+       name                             = "ssb-sms-gsa-tts-benefits-studio-notify-demo"
+       password                         = (sensitive value)
+       service_plans                    = (known after apply)
+       services                         = (known after apply)
+       space                            = "0b28b133-9f7b-49f1-9f34-a179cbb2549f"
+       url                              = "https://ssb-sms-notify-management-staging.app.cloud.gov"
+       username                         = "71880e4f-e3e6-3a99-b492-226f2306bce1"
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio/notify-management-staging"] will be created
+   resource "cloudfoundry_service_broker" "space_scoped_broker" {
+       catalog_change                   = false
+       catalog_hash                     = (known after apply)
+       fail_when_catalog_not_accessible = false
+       id                               = (known after apply)
+       name                             = "ssb-sms-gsa-tts-benefits-studio-notify-management-staging"
+       password                         = (sensitive value)
+       service_plans                    = (known after apply)
+       services                         = (known after apply)
+       space                            = "d835086a-1ce4-4b9e-bb0f-6b01a560b24a"
+       url                              = "https://ssb-sms-notify-management-staging.app.cloud.gov"
+       username                         = "71880e4f-e3e6-3a99-b492-226f2306bce1"
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio/notify-sandbox"] will be created
+   resource "cloudfoundry_service_broker" "space_scoped_broker" {
+       catalog_change                   = false
+       catalog_hash                     = (known after apply)
+       fail_when_catalog_not_accessible = false
+       id                               = (known after apply)
+       name                             = "ssb-sms-gsa-tts-benefits-studio-notify-sandbox"
+       password                         = (sensitive value)
+       service_plans                    = (known after apply)
+       services                         = (known after apply)
+       space                            = "5e8ae8ec-ff5b-49d8-ab31-8e9ba5d1c63c"
+       url                              = "https://ssb-sms-notify-management-staging.app.cloud.gov"
+       username                         = "71880e4f-e3e6-3a99-b492-226f2306bce1"
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio/notify-staging"] will be created
+   resource "cloudfoundry_service_broker" "space_scoped_broker" {
+       catalog_change                   = false
+       catalog_hash                     = (known after apply)
+       fail_when_catalog_not_accessible = false
+       id                               = (known after apply)
+       name                             = "ssb-sms-gsa-tts-benefits-studio-notify-staging"
+       password                         = (sensitive value)
+       service_plans                    = (known after apply)
+       services                         = (known after apply)
+       space                            = "9745decb-4988-4bab-88a4-e3f07b36241c"
+       url                              = "https://ssb-sms-notify-management-staging.app.cloud.gov"
+       username                         = "71880e4f-e3e6-3a99-b492-226f2306bce1"
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-demo"] will be destroyed
  # (because key ["gsa-tts-benefits-studio-prototyping/notify-demo"] is not in for_each map)
-   resource "cloudfoundry_service_broker" "space_scoped_broker" {
-       catalog_change                   = false -> null
-       catalog_hash                     = "xsRn_5Fbn_T3MyH1lrKZbd2Bwwk=" -> null
-       fail_when_catalog_not_accessible = false -> null
-       id                               = "05471952-9898-4237-b2d9-40f111ab018e" -> null
-       name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-demo" -> null
-       password                         = (sensitive value) -> null
-       service_plans                    = {
-           "datagov-smtp/base" = "aa42ef38-4c16-45a7-a04e-817945150b99"
        } -> null
-       services                         = {
-           "datagov-smtp" = "8a75c59c-0c4b-4764-907c-b0760c7278a0"
        } -> null
-       space                            = "0b28b133-9f7b-49f1-9f34-a179cbb2549f" -> null
-       url                              = "https://ssb-smtp-notify-management-staging.app.cloud.gov" -> null
-       username                         = "20e28794-0793-ec53-3d0d-d3a2ee162053" -> null
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-management-staging"] will be destroyed
  # (because key ["gsa-tts-benefits-studio-prototyping/notify-management-staging"] is not in for_each map)
-   resource "cloudfoundry_service_broker" "space_scoped_broker" {
-       catalog_change                   = false -> null
-       catalog_hash                     = "xsRn_5Fbn_T3MyH1lrKZbd2Bwwk=" -> null
-       fail_when_catalog_not_accessible = false -> null
-       id                               = "3096b0f1-3037-47cf-9e8e-3e700db2d580" -> null
-       name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-management-staging" -> null
-       password                         = (sensitive value) -> null
-       service_plans                    = {
-           "datagov-smtp/base" = "fd4fa0be-6875-4a61-beea-c176c11a819e"
        } -> null
-       services                         = {
-           "datagov-smtp" = "a5d0d531-d527-4a67-819b-6a4713d7d13f"
        } -> null
-       space                            = "d835086a-1ce4-4b9e-bb0f-6b01a560b24a" -> null
-       url                              = "https://ssb-smtp-notify-management-staging.app.cloud.gov" -> null
-       username                         = "20e28794-0793-ec53-3d0d-d3a2ee162053" -> null
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-staging"] will be destroyed
  # (because key ["gsa-tts-benefits-studio-prototyping/notify-staging"] is not in for_each map)
-   resource "cloudfoundry_service_broker" "space_scoped_broker" {
-       catalog_change                   = false -> null
-       catalog_hash                     = "xsRn_5Fbn_T3MyH1lrKZbd2Bwwk=" -> null
-       fail_when_catalog_not_accessible = false -> null
-       id                               = "b2536b75-2d3b-4a5a-aaa9-bda36761235c" -> null
-       name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-staging" -> null
-       password                         = (sensitive value) -> null
-       service_plans                    = {
-           "datagov-smtp/base" = "7630ae30-4883-4f84-b4c7-2779fdf6782f"
        } -> null
-       services                         = {
-           "datagov-smtp" = "b41dc2f2-7825-4a8e-987a-ce87a161e670"
        } -> null
-       space                            = "9745decb-4988-4bab-88a4-e3f07b36241c" -> null
-       url                              = "https://ssb-smtp-notify-management-staging.app.cloud.gov" -> null
-       username                         = "20e28794-0793-ec53-3d0d-d3a2ee162053" -> null
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio/notify-demo"] will be created
+   resource "cloudfoundry_service_broker" "space_scoped_broker" {
+       catalog_change                   = false
+       catalog_hash                     = (known after apply)
+       fail_when_catalog_not_accessible = false
+       id                               = (known after apply)
+       name                             = "ssb-smtp-gsa-tts-benefits-studio-notify-demo"
+       password                         = (sensitive value)
+       service_plans                    = (known after apply)
+       services                         = (known after apply)
+       space                            = "0b28b133-9f7b-49f1-9f34-a179cbb2549f"
+       url                              = "https://ssb-smtp-notify-management-staging.app.cloud.gov"
+       username                         = "20e28794-0793-ec53-3d0d-d3a2ee162053"
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio/notify-management-staging"] will be created
+   resource "cloudfoundry_service_broker" "space_scoped_broker" {
+       catalog_change                   = false
+       catalog_hash                     = (known after apply)
+       fail_when_catalog_not_accessible = false
+       id                               = (known after apply)
+       name                             = "ssb-smtp-gsa-tts-benefits-studio-notify-management-staging"
+       password                         = (sensitive value)
+       service_plans                    = (known after apply)
+       services                         = (known after apply)
+       space                            = "d835086a-1ce4-4b9e-bb0f-6b01a560b24a"
+       url                              = "https://ssb-smtp-notify-management-staging.app.cloud.gov"
+       username                         = "20e28794-0793-ec53-3d0d-d3a2ee162053"
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio/notify-sandbox"] will be created
+   resource "cloudfoundry_service_broker" "space_scoped_broker" {
+       catalog_change                   = false
+       catalog_hash                     = (known after apply)
+       fail_when_catalog_not_accessible = false
+       id                               = (known after apply)
+       name                             = "ssb-smtp-gsa-tts-benefits-studio-notify-sandbox"
+       password                         = (sensitive value)
+       service_plans                    = (known after apply)
+       services                         = (known after apply)
+       space                            = "5e8ae8ec-ff5b-49d8-ab31-8e9ba5d1c63c"
+       url                              = "https://ssb-smtp-notify-management-staging.app.cloud.gov"
+       username                         = "20e28794-0793-ec53-3d0d-d3a2ee162053"
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio/notify-staging"] will be created
+   resource "cloudfoundry_service_broker" "space_scoped_broker" {
+       catalog_change                   = false
+       catalog_hash                     = (known after apply)
+       fail_when_catalog_not_accessible = false
+       id                               = (known after apply)
+       name                             = "ssb-smtp-gsa-tts-benefits-studio-notify-staging"
+       password                         = (sensitive value)
+       service_plans                    = (known after apply)
+       services                         = (known after apply)
+       space                            = "9745decb-4988-4bab-88a4-e3f07b36241c"
+       url                              = "https://ssb-smtp-notify-management-staging.app.cloud.gov"
+       username                         = "20e28794-0793-ec53-3d0d-d3a2ee162053"
    }

Plan: 8 to add, 0 to change, 6 to destroy.

Changes to Outputs:
!~  client_spaces = [
!~      "gsa-tts-benefits-studio-prototyping/notify-demo" -> "gsa-tts-benefits-studio/notify-demo",
!~      "gsa-tts-benefits-studio-prototyping/notify-management-staging" -> "gsa-tts-benefits-studio/notify-management-staging",
!~      "gsa-tts-benefits-studio-prototyping/notify-sandbox" -> "gsa-tts-benefits-studio/notify-sandbox",
!~      "gsa-tts-benefits-studio-prototyping/notify-staging" -> "gsa-tts-benefits-studio/notify-staging",
    ]
```
</details>

:x: Error applying plan in [apply #20](https://github.com/GSA/usnotify-ssb/actions/runs/9011584128)